redis_performance/Performance Without Stress.txt
====== PING_INLINE ======
  100000 requests completed in 1.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.09% <= 1 milliseconds
99.60% <= 2 milliseconds
99.78% <= 3 milliseconds
99.89% <= 4 milliseconds
99.90% <= 5 milliseconds
99.95% <= 6 milliseconds
99.96% <= 7 milliseconds
100.00% <= 7 milliseconds
61576.36 requests per second

====== PING_BULK ======
  100000 requests completed in 1.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.67% <= 1 milliseconds
99.77% <= 2 milliseconds
99.87% <= 3 milliseconds
99.88% <= 4 milliseconds
99.89% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 6 milliseconds
60422.96 requests per second

====== SET ======
  100000 requests completed in 1.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.08% <= 1 milliseconds
99.56% <= 2 milliseconds
99.72% <= 3 milliseconds
99.76% <= 4 milliseconds
99.81% <= 6 milliseconds
99.90% <= 7 milliseconds
99.95% <= 9 milliseconds
99.95% <= 10 milliseconds
100.00% <= 10 milliseconds
59808.61 requests per second

====== GET ======
  100000 requests completed in 1.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.36% <= 1 milliseconds
99.78% <= 2 milliseconds
99.91% <= 4 milliseconds
99.96% <= 6 milliseconds
100.00% <= 6 milliseconds
60864.27 requests per second

====== INCR ======
  100000 requests completed in 1.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.70% <= 1 milliseconds
99.80% <= 2 milliseconds
99.90% <= 3 milliseconds
99.91% <= 4 milliseconds
99.95% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 6 milliseconds
61538.46 requests per second

====== LPUSH ======
  100000 requests completed in 1.60 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.60% <= 1 milliseconds
99.72% <= 2 milliseconds
99.76% <= 3 milliseconds
99.86% <= 4 milliseconds
99.91% <= 5 milliseconds
99.95% <= 7 milliseconds
100.00% <= 7 milliseconds
62578.22 requests per second

====== RPUSH ======
  100000 requests completed in 1.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.42% <= 1 milliseconds
99.84% <= 2 milliseconds
99.90% <= 4 milliseconds
99.92% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 6 milliseconds
60679.61 requests per second

====== LPOP ======
  100000 requests completed in 1.59 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.45% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
62774.64 requests per second

====== RPOP ======
  100000 requests completed in 1.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.24% <= 1 milliseconds
99.94% <= 2 milliseconds
100.00% <= 2 milliseconds
61274.51 requests per second

====== SADD ======
  100000 requests completed in 1.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.70% <= 1 milliseconds
99.95% <= 2 milliseconds
100.00% <= 2 milliseconds
61312.08 requests per second

====== HSET ======
  100000 requests completed in 1.59 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.74% <= 1 milliseconds
99.94% <= 2 milliseconds
100.00% <= 3 milliseconds
100.00% <= 3 milliseconds
62972.29 requests per second

====== SPOP ======
  100000 requests completed in 1.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.31% <= 1 milliseconds
99.96% <= 2 milliseconds
100.00% <= 2 milliseconds
60642.81 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.49% <= 1 milliseconds
99.91% <= 2 milliseconds
100.00% <= 2 milliseconds
62266.50 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 2.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

65.22% <= 1 milliseconds
99.78% <= 2 milliseconds
99.97% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 5 milliseconds
37119.52 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 6.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
95.37% <= 2 milliseconds
99.59% <= 3 milliseconds
99.93% <= 4 milliseconds
99.97% <= 5 milliseconds
99.97% <= 6 milliseconds
99.99% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
15782.83 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 8.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
36.24% <= 2 milliseconds
98.94% <= 3 milliseconds
99.81% <= 4 milliseconds
99.93% <= 5 milliseconds
99.96% <= 6 milliseconds
99.96% <= 7 milliseconds
100.00% <= 7 milliseconds
11948.86 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 10.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
90.07% <= 3 milliseconds
99.22% <= 4 milliseconds
99.74% <= 5 milliseconds
99.90% <= 6 milliseconds
99.98% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 8 milliseconds
9228.50 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.07 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

54.82% <= 1 milliseconds
99.39% <= 2 milliseconds
99.95% <= 3 milliseconds
99.99% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 5 milliseconds
48402.71 requests per second