redis_performance/Performance with 1 worker in stress.txt
====== PING_INLINE ======
  100000 requests completed in 2.47 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

76.16% <= 1 milliseconds
95.89% <= 2 milliseconds
98.86% <= 3 milliseconds
99.39% <= 4 milliseconds
99.71% <= 5 milliseconds
99.93% <= 6 milliseconds
99.95% <= 7 milliseconds
100.00% <= 7 milliseconds
40485.83 requests per second

====== PING_BULK ======
  100000 requests completed in 2.44 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

78.73% <= 1 milliseconds
97.69% <= 2 milliseconds
99.57% <= 3 milliseconds
99.74% <= 4 milliseconds
99.80% <= 5 milliseconds
99.91% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
40916.53 requests per second

====== SET ======
  100000 requests completed in 2.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

78.22% <= 1 milliseconds
97.41% <= 2 milliseconds
99.51% <= 3 milliseconds
99.76% <= 4 milliseconds
99.85% <= 5 milliseconds
99.86% <= 6 milliseconds
99.91% <= 7 milliseconds
99.92% <= 8 milliseconds
100.00% <= 8 milliseconds
42955.32 requests per second

====== GET ======
  100000 requests completed in 2.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

78.82% <= 1 milliseconds
97.49% <= 2 milliseconds
99.51% <= 3 milliseconds
99.78% <= 4 milliseconds
99.84% <= 5 milliseconds
99.87% <= 6 milliseconds
100.00% <= 7 milliseconds
41893.59 requests per second

====== INCR ======
  100000 requests completed in 2.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

77.84% <= 1 milliseconds
96.95% <= 2 milliseconds
99.39% <= 3 milliseconds
99.73% <= 4 milliseconds
99.87% <= 5 milliseconds
99.93% <= 6 milliseconds
99.97% <= 7 milliseconds
100.00% <= 7 milliseconds
41876.05 requests per second

====== LPUSH ======
  100000 requests completed in 2.49 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

69.56% <= 1 milliseconds
95.85% <= 2 milliseconds
99.75% <= 3 milliseconds
99.96% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 5 milliseconds
40160.64 requests per second

====== RPUSH ======
  100000 requests completed in 2.48 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

69.50% <= 1 milliseconds
95.44% <= 2 milliseconds
99.55% <= 3 milliseconds
99.84% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
40257.65 requests per second

====== LPOP ======
  100000 requests completed in 2.48 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

70.98% <= 1 milliseconds
95.19% <= 2 milliseconds
99.31% <= 3 milliseconds
99.91% <= 4 milliseconds
99.97% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
40306.33 requests per second

====== RPOP ======
  100000 requests completed in 2.56 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

72.10% <= 1 milliseconds
95.21% <= 2 milliseconds
99.59% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 4 milliseconds
39032.00 requests per second

====== SADD ======
  100000 requests completed in 2.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

80.00% <= 1 milliseconds
97.66% <= 2 milliseconds
99.55% <= 3 milliseconds
99.74% <= 4 milliseconds
99.84% <= 5 milliseconds
99.91% <= 6 milliseconds
99.98% <= 7 milliseconds
100.00% <= 7 milliseconds
42265.43 requests per second

====== HSET ======
  100000 requests completed in 2.52 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

70.01% <= 1 milliseconds
95.82% <= 2 milliseconds
99.55% <= 3 milliseconds
99.87% <= 4 milliseconds
99.95% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
39619.65 requests per second

====== SPOP ======
  100000 requests completed in 2.54 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

71.62% <= 1 milliseconds
97.09% <= 2 milliseconds
99.75% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 5 milliseconds
39447.73 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

70.99% <= 1 milliseconds
95.14% <= 2 milliseconds
99.38% <= 3 milliseconds
99.83% <= 4 milliseconds
99.93% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
39184.95 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 4.96 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

27.11% <= 1 milliseconds
73.55% <= 2 milliseconds
92.40% <= 3 milliseconds
97.42% <= 4 milliseconds
98.89% <= 5 milliseconds
99.28% <= 6 milliseconds
99.54% <= 7 milliseconds
99.76% <= 8 milliseconds
99.84% <= 9 milliseconds
99.91% <= 10 milliseconds
99.93% <= 11 milliseconds
99.98% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 13 milliseconds
20169.42 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 9.59 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
41.74% <= 2 milliseconds
82.40% <= 3 milliseconds
97.35% <= 4 milliseconds
99.41% <= 5 milliseconds
99.78% <= 6 milliseconds
99.88% <= 7 milliseconds
99.94% <= 8 milliseconds
99.98% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 11 milliseconds
100.00% <= 11 milliseconds
10429.70 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 13.17 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.16% <= 2 milliseconds
39.25% <= 3 milliseconds
81.94% <= 4 milliseconds
97.30% <= 5 milliseconds
99.27% <= 6 milliseconds
99.70% <= 7 milliseconds
99.88% <= 8 milliseconds
99.92% <= 9 milliseconds
99.96% <= 10 milliseconds
99.98% <= 11 milliseconds
100.00% <= 12 milliseconds
7594.74 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 16.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.02% <= 2 milliseconds
16.63% <= 3 milliseconds
50.41% <= 4 milliseconds
85.14% <= 5 milliseconds
97.39% <= 6 milliseconds
99.09% <= 7 milliseconds
99.59% <= 8 milliseconds
99.75% <= 9 milliseconds
99.85% <= 10 milliseconds
99.91% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 15 milliseconds
6151.20 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 3.45 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

16.96% <= 1 milliseconds
71.32% <= 2 milliseconds
95.45% <= 3 milliseconds
99.01% <= 4 milliseconds
99.57% <= 5 milliseconds
99.86% <= 6 milliseconds
99.91% <= 7 milliseconds
99.98% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
28968.71 requests per second